{
    "perfil": {
        "nombre": "Gleiston Guerrero",
        "frase": "La gloria de Dios es la Inteligencia",
        "contacto": {
            "telefono": "099 961 8561",
            "correo": "gguerrero@uteq.edu.ec",
            "sitio": "www.gleiston.site",
            "ubicacion": "Quevedo"
        },
        "descripcion": "Docente tiempo completo de la carrera de Ingeniería de Software en la Facultad de Ciencias de la Ingeniería de la Universidad Técnica Estatal de Quevedo. Preocupado por dar a conocer las nuevas tecnologías de desarrollo de aplicaciones distribuidas orientadas a web a los estudiantes de las asignaturas de Aplicaciones Web y Aplicaciones Distribuidas."
    },
    "experiencia": [
        {
            "titulo": "Docente Universidad Técnica Estatal de Quevedo",
            "ubicacion": "Quevedo",
            "fecha": "2000 - Actualidad",
            "descripcion": "Ha dictado cátedras relacionadas con Administración de Empresas, y con desarrollo y administración de sistemas. En los últimos 4 años ha dictado asignaturas como: Tecnologías de Internet, Programación Web, Aplicaciones Distribuidas, y Construcción de Software. Además ha sido director de Proyectos de Investigación de los estudiantes de pregrado en las carreras de Ingeniería en Sistemas, e Ingeniería de Software.",
            "logros": [
                "Creador del proyecto de modificación de pensum de la carrera de Ingeniería en Sistemas: Maya curricular 80% y de contenido 40% (2008)",
                "Presentado y aprobado el proyecto de creación de la carrera de Ingeniería en Diseño Gráfico.",
                "Director de Proyectos de Investigación de los estudiantes previos a obtener el título de Ingenieros en Sistemas",
                "Coordinador de Prácticas Preprofesionales, Coordinador de Área de estudios profesional.",
                "Director del Proyecto de Vinculación con la comunidad 'TELE-EDUCACIÓN PARA EL FORTALECIMIENTO DE LOS SABERES ANCESTRALES, VALORES Y EDUCACIÓN EN LAS FAMILIAS DE LOS SECTORES RURALES Y URBANO MARGINALES DE LA ZONA NORTE DE LA PROVINCIA DE LOS RÍOS'",
                "Colaborador en el proyecto de Investigación 'Uso de Internet of Things para proporcionar recordatorios a adultos mayores'"
            ]
        },
        {
            "titulo": "Docente en la Universidad de Guayaquil",
            "ubicacion": "Guayaquil",
            "fecha": "1998 - 2013",
            "descripcion": "Coordinador Académico de la Carrera de Ingeniería en Sistemas (1998-2001) y de la Carrera de Análisis de Sistemas (2002-2003, 2013-2014). Como tal en Ingeniería en Sistemas propuse la modificación del pensum en su maya en un 70% y en su contenido 30% (aprobado). Director de Tesis de Grado de Licenciados en Sistemas de Información, y Director de Proyectos Educativos en Licenciatura en Ciencias de la Educación con Mención en Informática.",
            "logros": [
                "Autor del proyecto de creación de la carrera de Ingeniería en Teleinformática.",
                "Director de Tesis de Grado de Licenciados en Sistemas de Información y Director de Proyectos Educativos en Licenciatura en Ciencias de la Educación con Mención en Informática."
            ]
        },
        {
            "titulo": "Profesor del Colegio AUGUSTO MENDOZA MOREIRA",
            "ubicacion": "Guayaquil",
            "fecha": "1996 – 1998",
            "descripcion": "Como tal plantié la modificación de los programas de estudio de las asignaturas del Área de Informática. Además de dar asesoramiento en la adquisición de equipos, adiestramiento del personal administrativo en el uso de las herramientas informáticas para sus labores.",
            "logros": []
        },
        {
            "titulo": "Desarrollador de Aplicaciones SURATEL",
            "ubicacion": "Guayaquil",
            "fecha": "1995 – 1996",
            "descripcion": "Encargado del desarrollo de aplicaciones para la depuración de la información bajada de los sistemas satelitales para la facturación de los servicios de telefonía que brindaba la empresa.",
            "logros": []
        },
        {
            "titulo": "Ayudante de Cátedra de la Escuela Superior Politécnica del Litoral",
            "ubicacion": "Guayaquil",
            "fecha": "1992 – 1997",
            "descripcion": "Ayudante de cátedra de: Estadística, Fundamentos de Computación, Matemáticas (pre-politécnico), y de Actividades Varias. Como ayudante de Actividades varias era el encargado del recogimiento de las evaluaciones a los docentes por parte de los estudiantes, de su procesamiento y la entrega a las respectivas autoridades.",
            "logros": []
        }
    ],
    "publicaciones": [
        {
            "titulo": "Test-Driven Development Tool for IoT Systems",
            "url": "https://ieeexplore.ieee.org/document/10720849",
            "resumen": "TDDT4IoTS is a comprehensive tool designed to streamline the development of IoT systems by integrating both device design and software application development within a test-driven framework. Its test-driven development approach enhances the reliability and efficiency of IoT systems by ensuring early error detection and facilitating the integration of diverse technologies. By addressing critical challenges such as interoperability and standardization, TDDT4IoTS empowers developers to overcome key obstacles in IoT adoption, ensuring scalable, robust, and feature-rich applications.",
            "anio": 2024
        },
        {
            "titulo": "BellChat: An Inclusive Web Application for Messaging",
            "url": "https://link.springer.com/chapter/10.1007/978-981-99-3043-2_35",
            "resumen": "The goal of the web is universal access, but minority groups of web users, such as people with disabilities and elderly people, are limited in their ability to communicate through chat applications. These types of applications include social networking, which are especially used in communication among their users. However, social networks such as Facebook (Messenger), Twitter and WhatsApp are not adapted for these groups, and therefore, they do not fully meet the needs for which they were created. Moreover, for people with disabilities to use web-based messaging applications, they are required to use third-party tools, such as screen readers. For these reasons, this paper presents BellChat, a responsive web application for communication between everybody, adapted for people with disabilities, especially for those ones with visual or hearing disabilities.",
            "anio": 2024
        },
        {
            "titulo": "Validation of a Development Methodology and Tool for IoT-based Systems through a Case Study for Visually Impaired People",
            "url": "https://www.sciencedirect.com/science/article/pii/S2542660523002238",
            "resumen": "In this article, we validate the Test-Driven Development Methodology for Internet of Things (IoT)-based Systems (TDDM4IoTS) and its companion tool, called Test-Driven Development Tool for IoT-based Systems (TDDT4IoTS). TDDM4IoTS consists of 11 stages, including activities ranging from system requirements gathering to system maintenance. To evaluate the effectiveness of TDDM4IoTS and TDDT4IoTS, in the last four academic years from 2019, System Engineering students have developed several IoT-based systems as part of their training, from the sixth semester (third academic year). Ñawi (phonetically, Gnawi), which is the case study presented herein, is one of them, and intends to assist visually impaired people to move through open environments.",
            "anio": 2023
        },
        {
            "titulo": "Internet of Things (IoT)-based indoor plant care system",
            "url": "https://content.iospress.com/articles/journal-of-ambient-intelligence-and-smart-environments/ais220483",
            "resumen": "The list of Sustainable Development Goals created by the United Nations include good health and well-being as one of its primary objectives. Pollution is a concern worldwide, and pollution levels inside buildings (homes or workplaces) can be higher than outdoors. To alleviate this problem and improve air quality, ornamental plants can be used. This paper presents the application of Internet of Things (IoT) technologies to develop a system called P4L, an acronym for “Plants for Life”. The objective of P4L is the automated care of potted plants to improve air quality and make the indoor environments of a building healthier. This IoT-based system (IoTS) has been developed through low-cost Arduino-compatible components.",
            "anio": 2023
        },
        {
            "titulo": "Agile Methodologies Applied to the Development of Internet of Things (IoT)-Based Systems: A Review",
            "url": "https://www.mdpi.com/1424-8220/23/2/790",
            "resumen": "Throughout the evolution of software systems, empirical methodologies have been used in their development process, even in the Internet of Things (IoT) paradigm, to develop IoT-based systems (IoTS). In this paper, we review the fundamentals included in the manifesto for agile software development, especially in the Scrum methodology, to determine its use and role in IoTS development. Initially, 4303 documents were retrieved, a number that was reduced to 186 after applying automatic filters and by the relevance of their titles. After analysing their contents, only 60 documents were considered. Of these, 38 documents present the development of an IoTS using some methodology, 8 present methodologies focused on the construction of IoTS software, and 14 present methodologies close to the systems life cycle (SLC). Finally, only one methodology can be considered SLC-compliant.",
            "anio": 2023
        },
        {
            "titulo": "Development and Assessment of an Indoor Air Quality Control IoT-Based System",
            "url": "https://www.mdpi.com/2079-9292/12/3/608",
            "resumen": "Good health and well-being are primary goals within the list of Sustainable Development Goals (SDGs) proposed by the United Nations (UN) in 2015. New technologies, such as Internet of Things (IoT) and Cloud Computing, can aid to achieve that goal by enabling people to improve their lifestyles and have a more healthy and comfortable life. Pollution monitoring is especially important in order to avoid exposure to fine particles and to control the impact of human activity on the natural environment. Some of the sources of hazardous gas emissions can be found indoors. For instance, carbon monoxide (CO), which is considered a silent killer because it can cause death, is emitted by water heaters and heaters that rely on fossil fuels.",
            "anio": 2023
        },
        {
            "titulo": "IdeAir: IoT-Based System for Indoor Air Quality Control",
            "url": "https://link.springer.com/chapter/10.1007/978-3-031-22356-3_19",
            "resumen": "The burning of fossil fuels by cars and household appliances, which make people’s lives easier, causes air quality to deteriorate. Fossil fuel-dependent (water and space) heaters, which help low-income people to live in better conditions, can cause their death. Many solutions to this social problem have been proposed; however, all of them suffer from some drawback that makes their application impossible for households with limited economic resources.",
            "anio": 2023
        },
        {
            "titulo": "Internet of Things (IoT)-Based System for Classroom Access Control and Resource Management",
            "url": "https://link.springer.com/chapter/10.1007/978-3-031-21333-5_61",
            "resumen": "Internet of Things (IoT) is transforming our society and even the way people interact with their environment. In an IoT-based system (IoTS), the identification, authentication and authorization of people and objects is especially important to be able to avoid privacy and security issues. This paper presents an IoTS to control access to classrooms and to efficiently manage their resources (lights and electric/electronic devices). Since the professor scheduled to teach a lesson at a given moment is the only authorized person to open the classroom door, this IoTS identifies that professor through facial recognition, considering a pre-established classroom schedule. In addition, RFID or fingerprint authentication are used to register the attendance of students to each lesson. To develop this IoTS, TDDM4IoTS (Test-Driven Development Methodology for IoT-based Systems) was used. This methodology encourages user engagement during the IoTS development. In fact, professors were involved from the very beginning, especially to improve the design of the mobile application interfaces, finally achieving 100% acceptance by them.",
            "anio": 2023
        },
        {
            "titulo": "Guidelines for the Design of Text Entry Applications for Older Adults",
            "url": "https://revistas.uteq.edu.ec/index.php/ingenio/article/view/411",
            "resumen": "The care and monitoring of the health of the elderly in order to increase life expectancy, their safety, make them self-sufficient, and improve their quality of life, have been the focus of many investigations that involve the use of the Internet of the Things or Internet of Things (IoT). Likewise, many of these systems, social networks and communication tools, are making it necessary for older people to be interested in the use of smartphones or Smartphones, which has inspired to carry out this work, whose objective is to determine the guidelines for the design of text entry applications for older adults. Some works carried out by other authors were considered to obtain the guidelines used for the development of a prototype (called KeySenior) focused on the entry of text, applying the guidelines considered positive for our purpose. The prototype was tested through a user study with a very heterogeneous group of elderly people, from their socio-economic level, the frequency of use and type of mobile phone, to the pathologies they suffer from. They finally answered a questionnaire with the help of one of the researchers, who also took notes of the most important observations, to help to determine the degree of fulfillment of the objective of this work. Some of the guidelines implemented in KeySenior did not have the expected acceptance, however most of them had great acceptance.",
            "anio": 2021
        },
        {
            "titulo": "TDDM4IoTS: A Test-Driven Development Methodology for Internet of Things (IoT)-Based Systems",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-42517-3_4",
            "resumen": "This paper presents a development methodology for Internet of Things (IoT)-based Systems (IoTS) that gathers ideas from several of the most outstanding software development paradigms nowadays, such as Model-Driven Engineering (MDE) and Test-Driven Development (TDD), in addition to incorporating the principles that govern agile software development methodologies, such as SCRUM and XP. The methodology presented here, called Test-Driven Development Methodology for IoTS (TDDM4IoTS), has been proposed after an exhaustive review of different software development methodologies, leading us to conclude that none of them are specially oriented towards the development of IoTS.",
            "anio": 2020
        },
        {
            "titulo": "IoT-Based Smart Medicine Dispenser to Control and Supervise Medication Intake",
            "url": "https://ebooks.iospress.nl/volumearticle/54741",
            "resumen": "This paper presents a system consisting of a smart medicine dispenser of solid medications (pills, capsules, …) and a mobile application for its configuration and management. The main idea is to offer a solution to help people (especially vulnerable ones) to avoid incorrect medication intakes. In this regard, the smart dispenser delivers the required medication if two conditions are met: (1) it is the scheduled time for a medication intake, and (2) the person who removes the medication from the dispenser (patient or caregiver) can be identified and is authorized to do so.",
            "anio": 2020
        },
        {
            "titulo": "A Ubiquitous Photo Frame to Provide Reminders to Older Adults",
            "url": "http://scielo.sld.cu/scielo.php?pid=S1990-86442020000100034&script=sci_abstract&tlng=pt",
            "resumen": "Over the years people tend to forget activities that take place every day, and particularly those ones that they do not carried out frequently. Forgetting activities is a common problem in various older adults. In the article it is analyzed how the Information and Communication Technologies can help elder people to manage this problem, but these people may not feel confident or comfortable to use a software application or a device. Therefore, we propose the use of common and ordinary objects to provide reminders that will allow preventing the forgetfulness of carrying out daily activities. As a first attempt, the current proposal consists of using a photo frame to provide these reminders. The developed prototype, using mobile devices, has been evaluated applying case study research. The results showed that the proposed idea was well received by the participants. Moreover, the participants suggested that other older adults could use our proposal to receive reminders easily and ubiquitously trying to prevent them from forgetting what they should/need/must do.",
            "anio": 2020
        },
        {
            "titulo": "From a Common Chair to a Device that Issues Reminders to Seniors",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-42520-3_35",
            "resumen": "Over the years, people tend to fail to recall different activities of everyday life, especially those that are performed less frequently. Forgetting a medical appointment, a family member’s birthday, or to take a medicine, is a common problem for many older adults. Although Information and Communication Technologies provide several options to help older adults remember activities like these, many of them could feel discouraged by not being able to properly use these tools and take full advantage of them. In other cases, elderly people may feel intimidated and even refuse to interact with technological devices.",
            "anio": 2019
        },
        {
            "titulo": "IoT Based System to Help Care for Dependent Elderly",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-05532-5_4",
            "resumen": "The aging of the population in most developed countries has increased the need of proposing and adopting systems to monitor the behaviour of elder people with cognitive impairment. Home monitoring is particularly important for caregivers and relatives, who are in charge of these persons in potentially risky environments (e.g., the kitchen, the bathroom, the stairs, go out alone to the street, etc.), while they perform their household activities.",
            "anio": 2019
        },
        {
            "titulo": "Factors that Influence Entrepreneurship and Its Impact on the Economic Development of Ecuador",
            "url": "https://revistas.uteq.edu.ec/index.php/csye/article/view/263",
            "resumen": "El emprendimiento ha cobrado interés para las escuelas de negocios desde la década de los ochenta debido a la relación con la creación y dirección de empresas, entre otras razones. El emprendimiento es un campo vasto que involucra diferentes tópicos como financiación del emprendimiento, características del emprendedor, emprendimiento corporativo, empresas de familia, reconocimiento de oportunidades, aprendizaje y emprendimiento social, entre otros.",
            "anio": 2018
        }
    ],
    "participacion_proyectos": [
        {
            "titulo": "MIoT-Health: Microservice-oriented design of IoT systems for a holistic and ecological assessment in eHealth - A case study of active and healthy ageing (2020 - 2024)",
            "url": "https://www.researchgate.net/project/MIoT-Health-Microservice-oriented-design-of-IoT-systems-for-a-holistic-and-ecological-assessment-in-eHealth-A-case-study-of-active-and-healthy-ageing",
            "resumen": "The general objective of this project is to create a design proposal for building comprehensive microservice-oriented IoT systems. This methodology will ensure relevant technical quality properties to support holistic and ecological user assessments in the eHealth domain, particularly to promote healthy and active ageing."
        },
        {
            "titulo": "Uso de “Internet of Things” para proporcionar recordatorios a adultos mayores (2018 - 2019)", 
            "url": "#",
            "resumen": "Investigador"
        },
        {
            "titulo": "Tele educación para el fortalecimiento de los saberes ancestrales, valores y educación en las familias de los sectores rurales y urbano marginales de la zona norte de la provincia de los ríos (2017 - 2019) - Director", 
            "url": "https://www.uteq.edu.ec/es/vinculacion/proyectos/pvsuteq-fci-02-64",
            "resumen": "Impulsar las prácticas de los valores humanos utilizando herramientas multimedia. Diseñar herramientas de aprendizaje como apoyo para la educación de las familias en aspectos básicos y actuales."
        }
    ],
    "habilidades": {
        "tecnicas": [
            "JavaScript/AngularJS",
            "Python/PHP/Java",
            "Node.js/ASP.NET",
            "PostgreSQL/MySQL",
            "Diseño orientado a objetos",
            "Diseñar e implementar estructuras de bases de datos",
            "Dirigir y entregar sistemas de software complejos"
        ],
        "interpersonales": [
            "Comunicación eficaz",
            "Trabajo en equipo",
            "Gestión del tiempo"
        ]
    },
    "educacion": [
        {
            "titulo": "Doctor en Tecnologías de la Información y Comunicación con Mensión Internacional",
            "institucion": "Universidad de Granada",
            "fecha": "2018 - 2024"
        },
        {
            "titulo": "Máster en Desarrollo de Software",
            "institucion": "Universidad de Granada",
            "fecha": "2017 - 2018"
        },
        {
            "titulo": "Diplomado Superior en Diseños Pedagógicos Universitarios",
            "institucion": "Universidad Técnica Estatal de Quevedo",
            "fecha": "2008 - 2009"
        },
        {
            "titulo": "MBA en Administración de empresas",
            "institucion": "Universidad Complutense de Madrid",
            "fecha": "2007 - 2009"
        },
        {
            "titulo": "Diplomado Superior en Pedagogía",
            "institucion": "Universidad de Guayaquil",
            "fecha": "2007 - 2008"
        },
        {
            "titulo": "Ingeniero en Computación",
            "institucion": "Escuela Superior Politécnica del Litoral (ESPOL)",
            "fecha": "1991 - 1997"
        }
    ],
    "idiomas": [
        {
            "idioma": "Español",
            "nivel": "Nativo"
        },
        {
            "idioma": "Inglés",
            "nivel": "Profesional"
        }
    ],
    "intereses": [
        "Investigación",
        "Dictado de Cátedra",
        "Desarrollo de Software"
    ],
    "lineas_investigacion": [
        "Internet de las cosas",
        "Modelado de sistemas",
        "Entornos inteligentes",
        "Desarrollo de Sistemas y Software",
        "Aplicaciones de Inteligencia Artificial"
    ],
    "secciones": {
        "experiencia": "Experiencias de Trabajo",
        "publicaciones": "Publicaciones",
        "participacion_proyectos": "Participación en proyectos de investigación y vinculación",
        "habilidades": "Habilidades",
        "habilidades_tecnicas": "Técnicas",
        "habilidades_interpersonales": "Interpersonales",
        "educacion": "Educación",
        "idiomas": "Lenguajes",
        "intereses": "Intereses",
        "lineas_investigacion": "Líneas de Investigación"
    },
    "footer": {
        "diseniado_por": "Diseñado por",
        "autor": "Duval Carvajal"
    }
}