{
    "perfil": {
        "nombre": "Gleiston Guerrero",
        "frase": "The glory of God is Intelligence",
        "contacto": {
            "telefono": "+593 99 961 8561",
            "correo": "gguerrero@uteq.edu.ec",
            "sitio": "www.gleiston.site",
            "ubicacion": "Quevedo"
        },
        "descripcion": "Full-time professor of the Software Engineering program in the Faculty of Engineering Sciences at the Technical State University of Quevedo. Committed to introducing new technologies for the development of distributed web-oriented applications to students in Web Applications and Distributed Applications courses."
    },
    "experiencia": [
        {
            "titulo": "Professor at Technical State University of Quevedo",
            "ubicacion": "Quevedo",
            "fecha": "2000 - Present",
            "descripcion": "Has taught courses related to Business Administration, systems development, and systems management. In the last 4 years, has taught courses such as Internet Technologies, Web Programming, Distributed Applications, and Software Construction. Additionally, he has supervised Research Projects for undergraduate students in Systems Engineering and Software Engineering programs.",
            "logros": [
                "Creator of the project for modifying the curriculum of the Systems Engineering program: Curriculum grid updated by 80% and content revised by 40% (2008).",
                "Presented and approved the project for creating the Graphic Design Engineering program.",
                "Supervised Research Projects for students prior to obtaining their Systems Engineering degree.",
                "Coordinator of Pre-professional Practices and Coordinator of Professional Studies Area.",
                "Director of the Community Outreach Project 'Tele-Education for the Strengthening of Ancestral Knowledge, Values, and Education in Families in Rural and Marginal Urban Areas of the Northern Zone of Los Ríos Province.'",
                "Collaborator in the Research Project 'Use of the Internet of Things to provide reminders to the elderly.'"
            ]
        },
        {
            "titulo": "Professor at the University of Guayaquil",
            "ubicacion": "Guayaquil",
            "fecha": "1998 - 2013",
            "descripcion": "Academic Coordinator of the Systems Engineering program (1998-2001) and Systems Analysis program (2002-2003, 2013-2014). In Systems Engineering, I proposed modifications to the curriculum with a 70% change in grid and 30% in content (approved). Supervisor of thesis projects for Bachelor of Information Systems students and Director of Educational Projects in Bachelor of Science Education with a major in Informatics.",
            "logros": [
                "Author of the project to create the Telecommunications Engineering program.",
                "Thesis Supervisor for Bachelor of Information Systems students and Director of Educational Projects in Bachelor of Science Education with a major in Informatics."
            ]
        },
        {
            "titulo": "Teacher at AUGUSTO MENDOZA MOREIRA High School",
            "ubicacion": "Guayaquil",
            "fecha": "1996 – 1998",
            "descripcion": "Proposed modifications to study programs for Informatics courses. Also provided advice on equipment acquisition and trained administrative staff in the use of IT tools for their work tasks.",
            "logros": []
        },
        {
            "titulo": "Application Developer at SURATEL",
            "ubicacion": "Guayaquil",
            "fecha": "1995 – 1996",
            "descripcion": "Responsible for developing applications to process information downloaded from satellite systems for billing telephone services provided by the company.",
            "logros": []
        },
        {
            "titulo": "Teaching Assistant at Escuela Superior Politécnica del Litoral",
            "ubicacion": "Guayaquil",
            "fecha": "1992 – 1997",
            "descripcion": "Teaching assistant in courses including Statistics, Fundamentals of Computing, Mathematics (pre-polytechnic), and Various Activities. As an assistant in Various Activities, was responsible for collecting student evaluations of faculty, processing them, and delivering results to relevant authorities.",
            "logros": []
        }
    ],
    "publicaciones": [
        {
            "titulo": "Test-Driven Development Tool for IoT Systems",
            "url": "https://ieeexplore.ieee.org/document/10720849",
            "resumen": "TDDT4IoTS is a comprehensive tool designed to streamline the development of IoT systems by integrating both device design and software application development within a test-driven framework. Its test-driven development approach enhances the reliability and efficiency of IoT systems by ensuring early error detection and facilitating the integration of diverse technologies. By addressing critical challenges such as interoperability and standardization, TDDT4IoTS empowers developers to overcome key obstacles in IoT adoption, ensuring scalable, robust, and feature-rich applications.",
            "anio": 2024
        },
        {
            "titulo": "BellChat: An Inclusive Web Application for Messaging",
            "url": "https://link.springer.com/chapter/10.1007/978-981-99-3043-2_35",
            "resumen": "The goal of the web is universal access, but minority groups of web users, such as people with disabilities and elderly people, are limited in their ability to communicate through chat applications. These types of applications include social networking, especially used for communication among users. However, social networks such as Facebook (Messenger), Twitter, and WhatsApp are not adapted for these groups and, therefore, do not fully meet the needs they were created for. Moreover, for people with disabilities to use web-based messaging applications, they are required to use third-party tools, such as screen readers. For these reasons, this paper presents BellChat, a responsive web application for communication among all people, adapted for individuals with disabilities, particularly those with visual or hearing impairments.",
            "anio": 2024
        },
        {
            "titulo": "Validation of a Development Methodology and Tool for IoT-based Systems through a Case Study for Visually Impaired People",
            "url": "https://www.sciencedirect.com/science/article/pii/S2542660523002238",
            "resumen": "In this article, we validate the Test-Driven Development Methodology for Internet of Things (IoT)-based Systems (TDDM4IoTS) and its accompanying tool, called Test-Driven Development Tool for IoT-based Systems (TDDT4IoTS). TDDM4IoTS consists of 11 stages, including activities ranging from system requirements gathering to system maintenance. To evaluate the effectiveness of TDDM4IoTS and TDDT4IoTS, in the last four academic years starting in 2019, Systems Engineering students have developed several IoT-based systems as part of their training from the sixth semester (third academic year). Ñawi (phonetically, Gnawi), the case study presented here, is one such system, aimed at assisting visually impaired individuals in navigating open environments.",
            "anio": 2023
        },
        {
            "titulo": "Internet of Things (IoT)-based indoor plant care system",
            "url": "https://content.iospress.com/articles/journal-of-ambient-intelligence-and-smart-environments/ais220483",
            "resumen": "The Sustainable Development Goals established by the United Nations include good health and well-being as a primary objective. Pollution remains a global concern, and indoor pollution levels (homes or workplaces) can exceed outdoor levels. To address this issue and improve air quality, ornamental plants can be used. This paper presents the application of Internet of Things (IoT) technologies to develop a system called P4L, 'Plants for Life'. P4L automates the care of potted plants to enhance air quality, creating healthier indoor environments. This IoT-based system was developed with low-cost, Arduino-compatible components.",
            "anio": 2023
        },
        {
            "titulo": "Agile Methodologies Applied to the Development of Internet of Things (IoT)-Based Systems: A Review",
            "url": "https://www.mdpi.com/1424-8220/23/2/790",
            "resumen": "Throughout the evolution of software systems, empirical methodologies have been used in their development processes, even in the Internet of Things (IoT) paradigm, to build IoT-based systems (IoTS). In this paper, we review the fundamentals of the Agile Software Development Manifesto, with a focus on the Scrum methodology, to determine its use and role in IoT system development. Initially, 4303 documents were retrieved, later narrowed down to 186 by filtering based on titles. After content analysis, only 60 documents were relevant, with 38 discussing IoT system development methodologies, 8 focusing on IoT software development methodologies, and 14 addressing the Systems Life Cycle (SLC). Finally, only one methodology was considered SLC-compliant.",
            "anio": 2023
        },
        {
            "titulo": "Development and Assessment of an Indoor Air Quality Control IoT-Based System",
            "url": "https://www.mdpi.com/2079-9292/12/3/608",
            "resumen": "Good health and well-being are primary goals within the Sustainable Development Goals (SDGs) proposed by the United Nations in 2015. Emerging technologies like the Internet of Things (IoT) and Cloud Computing can help achieve this goal by promoting healthier lifestyles. Pollution monitoring is crucial to avoid exposure to harmful particles and control the environmental impact of human activity. Hazardous gas emissions can occur indoors, with sources like fossil-fuel-based heaters emitting carbon monoxide (CO), a deadly gas. This paper addresses these challenges through the development of an IoT-based indoor air quality control system.",
            "anio": 2023
        },
        {
            "titulo": "IdeAir: IoT-Based System for Indoor Air Quality Control",
            "url": "https://link.springer.com/chapter/10.1007/978-3-031-22356-3_19",
            "resumen": "Fossil fuels used in cars and household appliances contribute to deteriorating air quality. While heaters (water and space) relying on fossil fuels help low-income individuals live better, they can also cause severe harm. Many solutions to this problem have been proposed, but their cost often makes them impractical for economically disadvantaged households. This paper presents IdeAir, an IoT-based system aimed at improving indoor air quality affordably.",
            "anio": 2023
        },
        {
            "titulo": "Internet of Things (IoT)-Based System for Classroom Access Control and Resource Management",
            "url": "https://link.springer.com/chapter/10.1007/978-3-031-21333-5_61",
            "resumen": "The Internet of Things (IoT) is transforming societal interactions with the environment. In an IoT-based system, secure identification, authentication, and authorization of people and objects are crucial to avoid privacy and security issues. This paper presents a system to control classroom access and manage resources (lighting, electrical/electronic devices) efficiently. Only authorized individuals can access classrooms, verified through facial recognition technology. RFID or fingerprint authentication tracks student attendance. The TDDM4IoTS (Test-Driven Development Methodology for IoT-based Systems) was used to develop this system, incorporating user feedback throughout, achieving 100% acceptance among users.",
            "anio": 2023
        },
        {
            "titulo": "Guidelines for the Design of Text Entry Applications for Older Adults",
            "url": "https://revistas.uteq.edu.ec/index.php/ingenio/article/view/411",
            "resumen": "The focus of many studies is on enhancing elderly health monitoring and care to increase life expectancy, autonomy, and quality of life. The Internet of Things (IoT) systems, social networks, and communication tools are encouraging seniors to adopt smartphones. This study identifies design guidelines for text entry applications for older adults. A prototype (KeySenior) based on these guidelines was tested with a diverse group of elderly individuals. Although some guidelines did not yield the expected results, most were well-received.",
            "anio": 2021
        },
        {
            "titulo": "TDDM4IoTS: A Test-Driven Development Methodology for Internet of Things (IoT)-Based Systems",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-42517-3_4",
            "resumen": "This paper presents a development methodology for Internet of Things (IoT)-based Systems, combining principles from Model-Driven Engineering (MDE), Test-Driven Development (TDD), and agile methodologies like SCRUM and XP. This methodology, called Test-Driven Development Methodology for IoT-based Systems (TDDM4IoTS), was created after a comprehensive review of various software development methodologies, concluding that none were specifically oriented toward IoT systems development.",
            "anio": 2020
        },
        {
            "titulo": "IoT-Based Smart Medicine Dispenser to Control and Supervise Medication Intake",
            "url": "https://ebooks.iospress.nl/volumearticle/54741",
            "resumen": "This paper presents a system with a smart medicine dispenser for solid medications (pills, capsules, etc.) and a mobile app for its configuration and management. The system helps people (especially vulnerable groups) avoid medication errors by dispensing medication only when it's time and only to authorized users.",
            "anio": 2020
        },
        {
            "titulo": "A Ubiquitous Photo Frame to Provide Reminders to Older Adults",
            "url": "http://scielo.sld.cu/scielo.php?pid=S1990-86442020000100034&script=sci_abstract&tlng=pt",
            "resumen": "Over time, people tend to forget daily tasks, especially those done infrequently. For older adults, this is common. This article explores how Information and Communication Technologies can help elderly individuals manage daily reminders without using complex technology. This study proposes a photo frame reminder system that uses ordinary objects to reduce the chances of forgetting essential tasks.",
            "anio": 2020
        },
        {
            "titulo": "From a Common Chair to a Device that Issues Reminders to Seniors",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-42520-3_35",
            "resumen": "Over the years, older adults may struggle to remember routine tasks, especially those done less frequently. Forgetting a medical appointment or a family member’s birthday is common among seniors. This article examines the potential of Information and Communication Technologies (ICT) to provide reminders for daily tasks. However, many older adults may feel intimidated by ICT, so a less invasive method, such as using familiar objects for reminders, was proposed.",
            "anio": 2019
        },
        {
            "titulo": "IoT-Based System to Help Care for Dependent Elderly",
            "url": "https://link.springer.com/chapter/10.1007/978-3-030-05532-5_4",
            "resumen": "The aging population in most developed countries has led to an increased need for systems that monitor the behavior of elderly people with cognitive impairments. Home monitoring is particularly crucial for caregivers and relatives who are responsible for these individuals in potentially hazardous environments (e.g., kitchens, bathrooms, staircases).",
            "anio": 2019
        },
        {
            "titulo": "Factors that Influence Entrepreneurship and Its Impact on the Economic Development of Ecuador",
            "url": "https://revistas.uteq.edu.ec/index.php/csye/article/view/263",
            "resumen": "Entrepreneurship has gained importance in business schools since the 1980s due to its association with company creation and management. It encompasses diverse topics such as venture financing, entrepreneur characteristics, corporate entrepreneurship, family businesses, opportunity recognition, learning, and social entrepreneurship.",
            "anio": 2018
        }
    ],
    "participacion_proyectos": [
        {
            "titulo": "MIoT-Health: Microservice-oriented design of IoT systems for a holistic and ecological assessment in eHealth - A case study of active and healthy ageing (2020 - 2024)",
            "url": "https://www.researchgate.net/project/MIoT-Health-Microservice-oriented-design-of-IoT-systems-for-a-holistic-and-ecological-assessment-in-eHealth-A-case-study-of-active-and-healthy-ageing",
            "resumen": "The general objective of this project is to create a design proposal for building comprehensive microservice-oriented IoT systems. This methodology ensures relevant technical quality properties that support holistic and ecological user assessments in eHealth, particularly to promote healthy and active aging."
        },
        {
            "titulo": "Use of 'Internet of Things' to Provide Reminders to Elderly Adults (2018 - 2019)", 
            "url": "#",
            "resumen": "Researcher"
        },
        {
            "titulo": "Tele-education for Strengthening Ancestral Knowledge, Values, and Education in Families from Rural and Urban Marginalized Sectors of the Northern Zone of Los Ríos Province (2017 - 2019) - Director", 
            "url": "https://www.uteq.edu.ec/es/vinculacion/proyectos/pvsuteq-fci-02-64",
            "resumen": "Promote the practice of human values using multimedia tools. Design learning tools as support for family education in basic and current aspects."
        }
    ],
    "habilidades": {
        "tecnicas": [
            "JavaScript/AngularJS",
            "Python/PHP/Java",
            "Node.js/ASP.NET",
            "PostgreSQL/MySQL",
            "Object-oriented design",
            "Designing and implementing database structures",
            "Managing and delivering complex software systems"
        ],
        "interpersonales": [
            "Effective communication",
            "Teamwork",
            "Time management"
        ]
    },
    "educacion": [
        {
            "titulo": "PhD in Information and Communication Technologies with International Distinction",
            "institucion": "University of Granada",
            "fecha": "2018 - 2024"
        },
        {
            "titulo": "Master's in Software Development",
            "institucion": "University of Granada",
            "fecha": "2017 - 2018"
        },
        {
            "titulo": "Higher Diploma in University Pedagogical Design",
            "institucion": "Technical State University of Quevedo",
            "fecha": "2008 - 2009"
        },
        {
            "titulo": "MBA in Business Administration",
            "institucion": "Complutense University of Madrid",
            "fecha": "2007 - 2009"
        },
        {
            "titulo": "Higher Diploma in Pedagogy",
            "institucion": "University of Guayaquil",
            "fecha": "2007 - 2008"
        },
        {
            "titulo": "Bachelor's Degree in Computer Science",
            "institucion": "Escuela Superior Politécnica del Litoral (ESPOL)",
            "fecha": "1991 - 1997"
        }
    ],
    "idiomas": [
        {
            "idioma": "Spanish",
            "nivel": "Native"
        },
        {
            "idioma": "English",
            "nivel": "Professional"
        }
    ],
    "intereses": [
        "Research",
        "Teaching",
        "Software Development"
    ],
    "lineas_investigacion": [
        "Internet of Things",
        "Systems Modeling",
        "Smart Environments",
        "Development of Systems and Software",
        "Artificial Intelligence Applications"
    ],
    "secciones": {
        "experiencia": "Work Experience",
        "publicaciones": "Publications",
        "participacion_proyectos": "Participation in research and outreach projects",
        "habilidades": "Skills",
        "habilidades_tecnicas": "Technical Skills",
        "habilidades_interpersonales": "Interpersonal Skills",
        "educacion": "Education",
        "idiomas": "Languages",
        "intereses": "Interests",
        "lineas_investigacion": "Research Areas"
    },
    "footer": {
        "diseniado_por": "Designed by",
        "autor": "Duval Carvajal"
    }
}